# Pandas

<b>there are two data structure in the Pandas</b><br>
1) Series     (1d array)<br>
2) Dataframe  (2d array)

In [1]:
import pandas as pd

## Series

In [4]:
data = {'a':1234567890, 'b':22222234, 'c':[1,2,3,4,5],'d':{1:12,2:4},'e':(1,2,3)}

In [5]:
pd.Series(data)

a         1234567890
b           22222234
c    [1, 2, 3, 4, 5]
d      {1: 12, 2: 4}
e          (1, 2, 3)
dtype: object

In [47]:
river = ['Ganges', 'Yamuna', 'Missisipi', 'Neil', 'Missouri']
river_ser = pd.Series(river, index = range(25,50,5))
river_ser

25       Ganges
30       Yamuna
35    Missisipi
40         Neil
45     Missouri
dtype: object

In [52]:
# if the Data are missing for the Indexes Pandas create the Nan for the missing value
data = {'b':100, 'a':(200, 36), 'c':10.20}
ser1 = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])
print(ser1)

a    (200, 36)
b          100
c         10.2
d          NaN
e          NaN
dtype: object

In [54]:
# But if the Index are not mentioned the the data will be excluded
data = {'b':100, 'a':(200, 36), 'c':10.20}
ser1 = pd.Series(data, index = ['a', 'b'])
print(ser1)

a    (200, 36)
b          100
dtype: object

In [70]:
#melwin Remeber in slicing of the series the end value will be considered 
data = {'b':100, 'a':(200, 36), 'c':10.20,'d':123,'e':809 }
ser1 = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])
print(ser1)
print("-----------------------------------------")
print(ser1['a':'c']) # Remeber in slicing of the series the end value will be considered (Inclusive)
print("-----------------------------------------")
print(ser1[:3])
print("-----------------------------------------")
print(ser1[0])
print("-----------------------------------------")
ser1['a']
print("-----------------------------------------")

a    (200, 36)
b          100
c         10.2
d          123
e          809
dtype: object
-----------------------------------------
a    (200, 36)
b          100
c         10.2
dtype: object
-----------------------------------------
a    (200, 36)
b          100
c         10.2
dtype: object
-----------------------------------------
(200, 36)
-----------------------------------------
-----------------------------------------

In [74]:
state = ['UP', 'AP', 'MP', 'KA', 'TN']
cap = ['LKO', 'AMT', 'BHP', 'BEN', 'CHN']
ser_state_cap = pd.Series(index = state, data = cap)
print(ser_state_cap)
print("----------------------------------")
print(ser_state_cap.index)
print("----------------------------------")
print(ser_state_cap.values)
print("----------------------------------")
print(ser_state_cap['UP':'TN':2])

UP    LKO
AP    AMT
MP    BHP
KA    BEN
TN    CHN
dtype: object
----------------------------------
Index(['UP', 'AP', 'MP', 'KA', 'TN'], dtype='object')
----------------------------------
['LKO' 'AMT' 'BHP' 'BEN' 'CHN']
----------------------------------
UP    LKO
MP    BHP
TN    CHN
dtype: object

## Data frame

In [75]:
state = ['UP', 'AP', 'MP', 'KA', 'TN']
state_df = pd.DataFrame(state, columns = ['State_Name'])
state_df

  State_Name
0         UP
1         AP
2         MP
3         KA
4         TN

In [76]:
cap = ['LKO', 'AMT', 'BHP', 'BEN', 'CHN']
cap_df = pd.DataFrame(cap, columns = ['Cap_Name'])
cap_df

  Cap_Name
0      LKO
1      AMT
2      BHP
3      BEN
4      CHN

In [79]:
satae_cap = list(zip(state, cap))
print(satae_cap)
stae_cap_df = pd.DataFrame(satae_cap, columns = ['State_name', 'Cap_name'])
stae_cap_df

[('UP', 'LKO'), ('AP', 'AMT'), ('MP', 'BHP'), ('KA', 'BEN'), ('TN', 'CHN')]

  State_name Cap_name
0         UP      LKO
1         AP      AMT
2         MP      BHP
3         KA      BEN
4         TN      CHN

In [90]:
pop_data = pd.read_csv('population2019.csv')
pop_data.head()

      Location  PopTotal
0  Afghanistan  7752.117
1  Afghanistan  7840.151
2  Afghanistan  7935.996
3  Afghanistan  8039.684
4  Afghanistan  8151.316

In [91]:
print(pop_data.columns)
pop_data = pop_data.dropna()
print("----------------------------------")
pop_data['PopTotal'].max()
print("----------------------------------")
pop_data['PopTotal'].min()
print("----------------------------------")
pop_data.describe(include = 'all')

Index(['Location', 'PopTotal'], dtype='object')
----------------------------------
----------------------------------
----------------------------------

       Location      PopTotal
count    280932  2.809320e+05
unique      474           NaN
top      Europe           NaN
freq       1768           NaN
mean        NaN  4.128536e+05
std         NaN  1.308911e+06
min         NaN  1.510000e-01
25%         NaN  1.240100e+03
50%         NaN  1.420555e+04
75%         NaN  1.171661e+05
max         NaN  2.163274e+07

Melwin Slicing even the end value is included (Inclusive) (Only in the Series)

zip function (combining the data frame)